api-gateway/test/artillery/user-journey.yml
config:
  target: "http://localhost:1000"
  phases:
    - duration: 10
      arrivalRate: 50
  processor: "../faker/user.js"
scenarios:
  - flow:
      - post:
          url: "/user"  
          beforeRequest: generateFakeUserData
          json:
            name: "{{name}}"
            email: "{{email}}"
            password: "{{password}}"
            age: "{{age}}"
            latitude: "{{latitude}}"
            longitude : "{{longitude}}"
          capture:
            - json: "$._id"
              as: "userId"
      - think: 3
      - post:
          url: "/user/login"  
          json:
            email: "{{email}}"
            password: "{{password}}"
          capture:
            - json: "$.access_token"
              as: "token"
      - think: 5
      - get:
          url: "/store"
          qs:
            page: "1"
            latitude: "-69.2902"
            longitude: "70.1323"
            maxDistance: "200000"
          headers:
            Authorization: "Bearer {{token}}"
          capture:
            - json: "$[0]._id"
              as: "storeId"
      - think: 3
      - post:
          url: "/purchase"
          headers:
            Authorization: "Bearer {{token}}"
          json:
            user: "{{userId}}"  
            store: "{{storeId}}"
            date: "{{date}}"